"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц (зима,
 весна, лето, осень).
 Напишите решения через list и через dict.
"""

# 1 через list
month_list = [['Зима', '12', '1', '2'], ['Весна', '3', '4', '5'], ['Лето', '6', '7', '8'], ['Осень', '9', '10', '11']]
good_num = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']
while True:
    month_num = input('Введите номер месяца: ')
    if month_num.isdigit() and month_num in good_num:
        break
    else:
        print('Ошибка ввода')
for month in month_list:
    if month_num in month:
        print(month[0])

# 2 через dict

month_dict = {'12': 'Зима', '1': 'Зима', '2': 'Зима', '3': 'Весна', '4': 'Весна', '5': 'Весна', '6': 'Лето',
              '7': 'Лето', '8': 'Лето', '9': 'Осень', '10': 'Осень', '11': 'Осень'}
good_num = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']
while True:
    month_num = input('Введите номер месяца: ')
    if month_num.isdigit() and month_num in good_num:
        break
    else:
        print('Ошибка ввода')

print(month_dict.get(month_num))
